## 4.1 Спецификация входных данных

Входные данные — текстовый файл программы на языке BNLang.

### Общая форма программы

Программа имеет структуру:

`begin <элементы> end`

где `<элементы>` — последовательность описаний переменных и/или операторов, разделённых `;` и/или переводами строк.

### Описания переменных

Описание переменных имеет вид:

`a, b, c : %`

где список идентификаторов разделяется запятыми, после двоеточия указывается тип:
- `%`
- `!`
- `$`

### Операторы

Поддерживаются:
- `x ass <выражение>`
- `if <выражение> then <оператор> [else <оператор>]`
- `for <присваивание> to <выражение> do <оператор>`
- `while <выражение> do <оператор>`
- `read( x, y, z )`
- `write( <выражение>, <выражение>, ... )`

Составной оператор задаётся последовательностью простых операторов, разделённых `:` и/или переводами строк (в реализации также разрешён `;`).

### Комментарии и пробелы

- комментарии: `{ ... }` (игнорируются);
- пробелы и табуляции игнорируются;
- переводы строк значимы и участвуют в разделении операторов.

